CourseSharePlatform/app/views/courses/show.html.erb

    <%n=0%>
    <% @course.course_scores.each do |score|%>
---
SELECT "course_scores".* FROM "course_scores" WHERE "course_scores"."course_id" = ?  [["course_id", 1]]


  <% if not current_user.courses.include? @course%>
---
SELECT 1 AS one FROM "courses" INNER JOIN "course_scores" ON "courses"."id" = "course_scores"."course_id" WHERE "course_scores"."user_id" = ? AND "courses"."id" = ? LIMIT ?  [["user_id", 13], ["id", 1], ["LIMIT", 1]]

  <%else%>
    <%my_score = current_user.course_scores.where(course_id: @course.id).first.course_score%>
---
SELECT "course_scores".* FROM "course_scores" WHERE "course_scores"."user_id" = ? AND "course_scores"."course_id" = ? ORDER BY "course_scores"."id" ASC LIMIT ?  [["user_id", 13], ["course_id", 1], ["LIMIT", 1]]