project/app/controllers/articles_controller.rb

  def create
    @course = Course.find(params[:course_id])
    @user = current_user
    @article = Article.new(article_params)
    @article.course = @course
    @article.user = current_user

    respond_to do |format|
      if @article.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "articles" ("course_id", "user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["course_id", 2], ["user_id", 20], ["title", "ass"], ["content", "st"], ["created_at", "2023-11-27 14:31:32.443426"], ["updated_at", "2023-11-27 14:31:32.443426"]]

  def destroy
    if current_user==@article.user || current_user.admin==1
    @article.destroy!
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]

  def beLiked
    if not @article.like_users.include? current_user
      @article.like_users << current_user
---
INSERT INTO "article_likes" ("like_user_id", "like_article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["like_user_id", 15], ["like_article_id", 1], ["created_at", "2023-11-22 02:01:26.513459"], ["updated_at", "2023-11-22 02:01:26.513459"]]

  def beFavored
    if not @article.favor_users.include? current_user
      @article.favor_users << current_user
---
INSERT INTO "article_favors" ("favor_user_id", "favor_article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["favor_user_id", 13], ["favor_article_id", 4], ["created_at", "2023-11-26 12:20:24.006040"], ["updated_at", "2023-11-26 12:20:24.006040"]]

  def beUnfavored
    if @article.favor_users.include? current_user
      @article.favor_users.delete(current_user)
---
DELETE FROM "article_favors" WHERE "article_favors"."id" = ?  [["id", 8]]