project/app/controllers/article_tags_controller.rb

  def create
  @article = Article.find(params[:article_id])
  if current_user==@article.user||current_user.admin==1
    @article_tag = ArticleTag.new(article_tag_params)
    @article_tag.article = @article

    respond_to do |format|
      if @article_tag.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "article_tags" ("article_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["article_id", 2], ["content", "3"], ["created_at", "2023-11-22 03:09:52.269794"], ["updated_at", "2023-11-22 03:09:52.269794"]]