project/app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_name", "course_description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["course_name", "oo"], ["course_description", "rr"], ["created_at", "2023-11-27 15:40:01.207991"], ["updated_at", "2023-11-27 15:40:01.207991"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "updated_at" = ? WHERE "courses"."id" = ?  [["updated_at", "2023-11-20 10:41:53.880697"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
---
  def destroy
    @course.destroy!

SELECT "article_tags".* FROM "article_tags" WHERE (content LIKE '%33%')
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
---
  def search_by_tag
    query = params[:query]
    tags = ArticleTag.where("content LIKE ?", "%#{query}%")
    articles = Article.where(id: tags.map(&:article_id))