project/app/controllers/course_files_controller.rb

  def index
    @course_files = CourseFile.all
---
SELECT "course_files".* FROM "course_files"

  def create
    @course = Course.find(params[:course_id])
    @course_file = CourseFile.new(course_file_params)
    @course_file.course = @course

    respond_to do |format|
      if @course_file.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "course_files" ("course_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["course_id", 1], ["title", "ww"], ["description", "22"], ["created_at", "2023-11-23 03:22:05.325829"], ["updated_at", "2023-11-23 03:22:05.325829"]]

  def update
    respond_to do |format|
      if @course_file.update(course_file_params)
---
UPDATE "course_files" SET "updated_at" = ? WHERE "course_files"."id" = ?  [["updated_at", "2023-11-23 03:22:05.373476"], ["id", 4]]

  def destroy
    @course_file.destroy!
---
DELETE FROM "course_files" WHERE "course_files"."id" = ?  [["id", 1]]

    def set_course_file
      @course_file = CourseFile.find(params[:id])
---
SELECT "course_files".* FROM "course_files" WHERE "course_files"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]