Project/app/controllers/question_replies_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "question_replies" ("question_id", "user_id", "content", "accepted", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["question_id", 1], ["user_id", 13], ["content", "yes\n"], ["accepted", 0], ["created_at", "2023-11-23 06:36:07.712936"], ["updated_at", "2023-11-23 06:36:07.712936"]]
---
  def create
    @question = Question.find(params[:question_id])
    @question_reply = QuestionReply.new(question_reply_params)
    @question_reply.question = @question
    @question_reply.user = current_user
    @question_reply.accepted = 0

    respond_to do |format|
      if @question_reply.save

UPDATE "question_replies" SET "accepted" = ?, "updated_at" = ? WHERE "question_replies"."id" = ?  [["accepted", 1], ["updated_at", "2023-11-23 06:56:49.801685"], ["id", 1]]
---
  def change_ac
    if @question_reply.accepted == 0
      @question_reply.accepted = 1
    else
      @question_reply.accepted = 0
    end
    respond_to do |format|
      if @question_reply.save

SELECT "question_replies".* FROM "question_replies" WHERE "question_replies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_question_reply
      @question_reply = QuestionReply.find(params[:id])