project/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        respond_to do |format|
            if @user.save
---
INSERT INTO "users" ("username", "password", "email", "img_path", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
        if @user == current_user || current_user.admin == 1
            user_params[:code] = @user[:code]
            respond_to do |format|
                if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "personal_sign" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-22 00:32:15.945527"], ["personal_sign", "ss"], ["id", 13]]

    def certainfy
        if params[:code] == 'zzzzz'
            current_user.update_attribute(:admin, 1)
---
UPDATE "users" SET "updated_at" = ?, "admin" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-27 02:49:49.194589"], ["admin", 1], ["id", 22]]

    def space
        followers = @user.followings # 命名失误了
        followers_articles = followers.map(&:articles).flatten
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? ORDER BY "articles"."created_at" DESC  [["user_id", 15]]

    def set_user
        # if params[:id] == 'sign_out'
        #   @user = current_user
        # else
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]