project/app/views/articles/_article.html.erb


  <%if not article.like_users.include? current_user%>
---
SELECT "users".* FROM "users" INNER JOIN "followships" ON "users"."id" = "followships"."following_user_id" WHERE "followships"."user_id" = ?  [["user_id", 20]]

  <p>文章标签:
  <%if article.article_tags ==nil || article.article_tags.length==0%>
---
SELECT "articles".* FROM "articles"
SELECT "article_tags".* FROM "article_tags" WHERE "article_tags"."article_id" = ?  [["article_id", 2]]

  <%else%>
    <%article.article_tags.each do |tag|%>
---
SELECT "article_tags".* FROM "article_tags" WHERE "article_tags"."article_id" = ?  [["article_id", 1]]