CourseSharePlatform/app/controllers/articles_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("course_id", "user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["course_id", 1], ["user_id", 13], ["title", "ss"], ["content", "ss"], ["created_at", "2023-11-23 03:18:58.307871"], ["updated_at", "2023-11-23 03:18:58.307871"]]
---
  def create
    @course = Course.find(params[:course_id])
    @user = current_user
    @article = Article.new(article_params)
    @article.course = @course
    @article.user = current_user

    respond_to do |format|
      if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    if current_user==@article.user || current_user.admin==1
    @article.destroy!

INSERT INTO "article_likes" ("like_user_id", "like_article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["like_user_id", 15], ["like_article_id", 1], ["created_at", "2023-11-22 02:01:26.513459"], ["updated_at", "2023-11-22 02:01:26.513459"]]
---
  def beLiked
    if not @article.like_users.include? current_user
      @article.like_users << current_user

INSERT INTO "article_favors" ("favor_user_id", "favor_article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["favor_user_id", 15], ["favor_article_id", 1], ["created_at", "2023-11-22 01:27:56.418751"], ["updated_at", "2023-11-22 01:27:56.418751"]]
---
  def beFavored
    if not @article.favor_users.include? current_user
      @article.favor_users << current_user