CourseSharePlatform/app/controllers/articles_controller.rb

  def beUnliked
    if @article.like_users.include? current_user
      @article.like_users.delete(current_user)
---
DELETE FROM "article_likes" WHERE "article_likes"."id" = ?  [["id", 10]]