CourseSharePlatform/app/controllers/course_comments_controller.rb

  def index
    @course_comments = CourseComment.all
---
SELECT "course_comments".* FROM "course_comments"

  def create
    @course = Course.find(params[:course_id])
    @course_comment = CourseComment.new(course_comment_params)
    @course_comment.course = @course
    @course_comment.user = current_user

    respond_to do |format|
      if @course_comment.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "course_comments" ("course_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["course_id", 1], ["content", "ss"], ["created_at", "2023-11-14 03:20:45.480965"], ["updated_at", "2023-11-14 03:20:45.480965"], ["user_id", 13]]

  def destroy
    @course_comment.destroy!
---
DELETE FROM "course_comments" WHERE "course_comments"."id" = ?  [["id", 5]]

  def beLiked
    if not @course_comment.like_users.include? current_user
      @course_comment.like_users << current_user
---
INSERT INTO "course_comment_likes" ("like_user_id", "like_course_comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["like_user_id", 15], ["like_course_comment_id", 3], ["created_at", "2023-11-16 03:44:27.094607"], ["updated_at", "2023-11-16 03:44:27.094607"]]

    def set_course_comment
      @course_comment = CourseComment.find(params[:id])
---
SELECT "course_comments".* FROM "course_comments" WHERE "course_comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]