CourseSharePlatform/app/controllers/course_scores_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "course_scores" ("course_score", "course_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["course_score", 10.0], ["course_id", 2], ["user_id", 13], ["created_at", "2023-11-15 04:43:54.534869"], ["updated_at", "2023-11-15 04:43:54.534869"]]
---
    def create
        @course = Course.find(params[:course_id])
        @course_score = CourseScore.new(course_score_params)
        @course_score.course = @course
        @course_score.user = current_user

        respond_to do |format|
            if @course_score.course_score<0 or @course_score.course_score>10
                format.html {redirect_to @course, notice: "分数需在0-10之间"}
                format.json { render :show, status: :created, location: @course_score }
            elsif @course_score.save