CourseSharePlatform/app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_name", "course_description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["course_name", "DataBase"], ["course_description", "sb"], ["created_at", "2023-11-13 12:48:08.121371"], ["updated_at", "2023-11-13 12:48:08.121371"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "updated_at" = ? WHERE "courses"."id" = ?  [["updated_at", "2023-11-20 10:41:53.880697"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)