CourseSharePlatform/app/controllers/course_comments_controller.rb

SELECT "course_comments".* FROM "course_comments" WHERE "course_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course_comment
      @course_comment = CourseComment.find(params[:id])