CourseSharePlatform/app/controllers/questions_controller.rb

  def create
    @course = Course.find(params[:course_id])
    @question = Question.new(question_params)
    @question.course = @course
    @question.user = current_user

    respond_to do |format|
      if @question.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "questions" ("course_id", "user_id", "title", "content", "solved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["course_id", 1], ["user_id", 13], ["title", "22"], ["content", "33"], ["solved", 0], ["created_at", "2023-11-23 03:53:12.272968"], ["updated_at", "2023-11-23 03:53:12.272968"]]

  def change_solved
    if @question.solved == 0
      @question.solved = 1
    else
      @question.solved = 0
    end

    respond_to do |format|
      if @question.save
---
UPDATE "questions" SET "solved" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["solved", 1], ["updated_at", "2023-11-23 07:24:52.476445"], ["id", 1]]