CourseSharePlatform/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "email", "img_path", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "personal_sign" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-22 00:26:13.123730"], ["personal_sign", "111"], ["id", 13]]

  def set_user
    # if params[:id] == 'sign_out'
    #   @user = current_user
    # else
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]