CourseSharePlatform/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_user
    # if params[:id] == 'sign_out'
    #   @user = current_user
    # else
      @user = User.find(params[:id])