project/app/views/courses/_course.html.erb

SELECT "courses".* FROM "courses"
---
      <p class="text-muted p-2">
        <% if course.course_description.size <= 80 %>