project/app/views/courses/list_course_files.html.erb

SELECT "course_files".* FROM "course_files" WHERE "course_files"."course_id" = ?  [["course_id", 1]]
---
    <div class="row row-grid align-items-center">
      <h2>课程资料</h2><span class="my-cnt">共<%=@course.course_files.length %>条记录</span>