project/app/views/courses/list_questions.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."course_id" = ?  [["course_id", 1]]
---
    <div class="row row-grid align-items-center">
      <h2>问题求助</h2><span class="my-cnt">共<%=@course.questions.length %>条记录</span><hr>