project/app/views/courses/list_articles.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."course_id" = ?  [["course_id", 1]]
---
    <div class="row row-grid align-items-center">
      <h2>课程文章</h2><span class="my-cnt">共<%=@course.articles.length %>条记录</span>