project/app/views/courses/list_comments.html.erb

SELECT "course_comments".* FROM "course_comments" WHERE "course_comments"."course_id" = ?  [["course_id", 2]]
---
    <div class="row row-grid align-items-center">
      <h2>课程评论</h2><span class="my-cnt">共<%=@course.course_comments.length %>条记录</span>