CourseSharePlatform/app/views/articles/_article.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."course_id" = ?  [["course_id", 1]]
SELECT "article_tags".* FROM "article_tags" WHERE "article_tags"."article_id" = ?  [["article_id", 4]]
---
  <p>文章标签</p>
  <%if article.article_tags ==nil || article.article_tags.length==0%>

SELECT "article_tags".* FROM "article_tags" WHERE "article_tags"."article_id" = ?  [["article_id", 1]]
---
  <%else%>
    <%article.article_tags.each do |tag|%>