project/app/views/users/list_questions.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 13]]
---
          <%=@user.username %>
        <% end %>的问题</h3><span class="my-cnt">共<%=@user.questions.length %>条记录</span>