project/app/views/users/space.html.erb

<% @user.followings.each do |following|%>
    <%following.articles.each do |article|%>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 15]]