CourseSharePlatform/app/views/course_comments/_course_comment.html.erb

SELECT "users".* FROM "users" INNER JOIN "course_comment_likes" ON "users"."id" = "course_comment_likes"."like_user_id" WHERE "course_comment_likes"."course_comment_id" = ?  [["course_comment_id", 1]]
---
    <%= course_comment.content %>
    <%if not course_comment.like_users.include? current_user%>